{
    "name": "HR Vacation Documents UA",
    "version": "1.0.0",
    "category": "Human Resources",
    "summary": "Створення, перегляд та подальший друк заяв на відпустку",
    'description': """
        Vacation Request Documents (Ukraine)
        
        Модуль призначений для автоматизації створення заяв на відпустку
        відповідно до вимог кадрового документообігу України.
        
        Працівник відкриває майстер створення заяви, обирає тип відпустки,
        вказує необхідні дати, після чого система автоматично формує документ,
        використовуючи дані з кадрової картки працівника.
        
        Модуль автоматично підставляє:
        • ПІБ працівника;
        • назву підприємства;
        • керівника;
        • структурний підрозділ;
        • період відпустки;
        • кількість календарних днів.
        
        Передбачено:
        • попередній перегляд документа у форматі PDF;
        • завантаження та друк заяви;
        • використання готових шаблонів заяв.
        
        Підтримуються такі типи заяв:
        • щорічна основна відпустка;
        • відпустка без збереження заробітної плати;
        • відпустка за сімейними обставинами;
        • відпустка у зв'язку з вагітністю та пологами;
        • відпустка для догляду за дитиною.
        
        Модуль розроблений для використання підприємствами України та відповідає
        типовим вимогам оформлення кадрових документів.
        """,
    "author": "TytencoSoft",
    "license": "LGPL-3",
    'price': "0",
    'currency': 'USD',
    'images': [],
    "depends": ['base','hr'],
    "data": [
        "views/vacation_empl.xml",
        "views/inherit_button_open_vacation.xml",
        "report/report_action.xml",
        "report/report_template.xml",
        "security/ir.model.access.csv"
    ],

    "installable": True,
    "auto_install": False,
}
